[Survived] BlockStatement
dist/src/folder_1/10_kata.js:5:38
     yield 'Hello';
     yield 'World';
 }
-export default function HelloWorld() {
-    return Array.from(helloWorldGenerator()).join(' ');
-}
+export default function HelloWorld() {}
 
