[Survived] BlockStatement
dist/src/folder_1/11_kata.js:1:36
-export const input = (commands) => {
-    let totalCost = +commands[0] * +commands[1];
-    const volumeDiscount = [
-        { volume: 50000, discount: 0.15 },
-        { volume: 10000, discount: 0.10 },
-        { volume: 7000, discount: 0.07 },
-        { volume: 5000, discount: 0.05 },
-        { volume: 1000, discount: 0.03 },
-    ];
-    volumeDiscount.some(({ volume, discount }, idx) => {
-        if (totalCost >= volume) {
-            totalCost = totalCost * (1 - discount);
-            return true;
-        }
-        return false;
-    });
-    const stateTaxes = {
-        UT: 6.85,
-        NV: 8.00,
-        TX: 6.25,
-        AL: 4.00,
-        CA: 8.25,
-    };
-    return totalCost * (1 + stateTaxes[commands[2]] / 100);
-};
+export const input = (commands) => {};
 

[Survived] BlockStatement
dist/src/folder_1/11_kata.js:10:56
         { volume: 5000, discount: 0.05 },
         { volume: 1000, discount: 0.03 },
     ];
-    volumeDiscount.some(({ volume, discount }, idx) => {
-        if (totalCost >= volume) {
-            totalCost = totalCost * (1 - discount);
-            return true;
-        }
-        return false;
-    });
+    volumeDiscount.some(({ volume, discount }, idx) => {});
     const stateTaxes = {
         UT: 6.85,

[Survived] MethodExpression
dist/src/folder_1/11_kata.js:10:5
         { volume: 5000, discount: 0.05 },
         { volume: 1000, discount: 0.03 },
     ];
-    volumeDiscount.some(({ volume, discount }, idx) => {
-        if (totalCost >= volume) {
-            totalCost = totalCost * (1 - discount);
-            return true;
-        }
-        return false;
-    });
+    volumeDiscount.every(({
+  volume,
+  discount
+}, idx) => {
+  if (totalCost >= volume) {
+    totalCost = totalCost * (1 - discount);
+    return true;
+  }
+  return false;
+});
     const stateTaxes = {
         UT: 6.85,

[Survived] ArithmeticOperator
dist/src/folder_1/11_kata.js:12:25
     ];
     volumeDiscount.some(({ volume, discount }, idx) => {
         if (totalCost >= volume) {
-            totalCost = totalCost * (1 - discount);
+            totalCost = totalCost / (1 - discount);
             return true;
         }

[Survived] ArithmeticOperator
dist/src/folder_1/11_kata.js:12:38
     ];
     volumeDiscount.some(({ volume, discount }, idx) => {
         if (totalCost >= volume) {
-            totalCost = totalCost * (1 - discount);
+            totalCost = totalCost * (1 + discount);
             return true;
         }

[Survived] BooleanLiteral
dist/src/folder_1/11_kata.js:13:20
     volumeDiscount.some(({ volume, discount }, idx) => {
         if (totalCost >= volume) {
             totalCost = totalCost * (1 - discount);
-            return true;
+            return false;
         }
         return false;

[Survived] ObjectLiteral
dist/src/folder_1/11_kata.js:17:24
         }
         return false;
     });
-    const stateTaxes = {
-        UT: 6.85,
-        NV: 8.00,
-        TX: 6.25,
-        AL: 4.00,
-        CA: 8.25,
-    };
+    const stateTaxes = {};
     return totalCost * (1 + stateTaxes[commands[2]] / 100);
 };

[Survived] ArithmeticOperator
dist/src/folder_1/11_kata.js:24:12
         AL: 4.00,
         CA: 8.25,
     };
-    return totalCost * (1 + stateTaxes[commands[2]] / 100);
+    return totalCost / (1 + stateTaxes[commands[2]] / 100);
 };
 

[Survived] ArithmeticOperator
dist/src/folder_1/11_kata.js:24:25
         AL: 4.00,
         CA: 8.25,
     };
-    return totalCost * (1 + stateTaxes[commands[2]] / 100);
+    return totalCost * (1 - stateTaxes[commands[2]] / 100);
 };
 
