[Survived] BlockStatement
dist/src/folder_1/12_kata.js:4:18
 export class Zergling {
     hitpoints = 1;
     closeUnits = [];
-    attack(unit) {
-        if (this.closeUnits.includes(unit)) {
-            unit.hurt(1);
-        }
-    }
+    attack(unit) {}
     alive() {
         return this.hitpoints > 0;

[Survived] ConditionalExpression
dist/src/folder_1/12_kata.js:5:13
     hitpoints = 1;
     closeUnits = [];
     attack(unit) {
-        if (this.closeUnits.includes(unit)) {
+        if (false) {
             unit.hurt(1);
         }

[Survived] ConditionalExpression
dist/src/folder_1/12_kata.js:5:13
     hitpoints = 1;
     closeUnits = [];
     attack(unit) {
-        if (this.closeUnits.includes(unit)) {
+        if (true) {
             unit.hurt(1);
         }

[Survived] BlockStatement
dist/src/folder_1/12_kata.js:9:13
             unit.hurt(1);
         }
     }
-    alive() {
-        return this.hitpoints > 0;
-    }
+    alive() {}
     run(unit) {
         this.closeUnits.push(unit);

[Survived] EqualityOperator
dist/src/folder_1/12_kata.js:10:16
         }
     }
     alive() {
-        return this.hitpoints > 0;
+        return this.hitpoints >= 0;
     }
     run(unit) {

[Survived] ConditionalExpression
dist/src/folder_1/12_kata.js:10:16
         }
     }
     alive() {
-        return this.hitpoints > 0;
+        return true;
     }
     run(unit) {

[Survived] BlockStatement
dist/src/folder_1/12_kata.js:12:15
     alive() {
         return this.hitpoints > 0;
     }
-    run(unit) {
-        this.closeUnits.push(unit);
-    }
+    run(unit) {}
     hurt(damage) {
         this.hitpoints -= damage;

[Survived] BlockStatement
dist/src/folder_1/12_kata.js:15:18
     run(unit) {
         this.closeUnits.push(unit);
     }
-    hurt(damage) {
-        this.hitpoints -= damage;
-    }
+    hurt(damage) {}
 }
 export class Marine {

[Survived] AssignmentOperator
dist/src/folder_1/12_kata.js:16:9
         this.closeUnits.push(unit);
     }
     hurt(damage) {
-        this.hitpoints -= damage;
+        this.hitpoints += damage;
     }
 }

[Survived] BlockStatement
dist/src/folder_1/12_kata.js:21:18
 }
 export class Marine {
     hitpoints = 2;
-    attack(unit) {
-        this.shoot(unit);
-    }
+    attack(unit) {}
     alive() {
         return true;

[Survived] BlockStatement
dist/src/folder_1/12_kata.js:24:13
     attack(unit) {
         this.shoot(unit);
     }
-    alive() {
-        return true;
-    }
+    alive() {}
     shoot(unit) {
         unit.hurt(1);

[Survived] BooleanLiteral
dist/src/folder_1/12_kata.js:25:16
         this.shoot(unit);
     }
     alive() {
-        return true;
+        return false;
     }
     shoot(unit) {

[Survived] BlockStatement
dist/src/folder_1/12_kata.js:27:17
     alive() {
         return true;
     }
-    shoot(unit) {
-        unit.hurt(1);
-    }
+    shoot(unit) {}
     hurt(damage) {
         this.hitpoints -= damage;

[Survived] BlockStatement
dist/src/folder_1/12_kata.js:36:18
 }
 export class Zealot {
     hitpoints = 2;
-    attack(unit) {
-        this.claw(unit);
-    }
+    attack(unit) {}
     alive() {
         return true;

[Survived] BlockStatement
dist/src/folder_1/12_kata.js:42:16
     alive() {
         return true;
     }
-    claw(unit) {
-        unit.hurt(2);
-    }
+    claw(unit) {}
     hurt(damage) {
         this.hitpoints -= damage;

[Survived] BlockStatement
dist/src/folder_1/12_kata.js:48:19
     hurt(damage) {
         this.hitpoints -= damage;
     }
-    hitpointBar() {
-        if (this.hitpoints === 2) {
-            return "full";
-        }
-        return "not full";
-    }
+    hitpointBar() {}
 }
 

[Survived] BlockStatement
dist/src/folder_1/12_kata.js:49:35
         this.hitpoints -= damage;
     }
     hitpointBar() {
-        if (this.hitpoints === 2) {
-            return "full";
-        }
+        if (this.hitpoints === 2) {}
         return "not full";
     }

[Survived] ConditionalExpression
dist/src/folder_1/12_kata.js:49:13
         this.hitpoints -= damage;
     }
     hitpointBar() {
-        if (this.hitpoints === 2) {
+        if (true) {
             return "full";
         }
