[Survived] ArithmeticOperator
dist/src/folder_1/14_kata.js:24:29
         AL: 4.00,
         CA: 8.25,
     };
-    return totalCost * (1 + stateTaxes[commands[2]] / 100);
+    return totalCost * (1 + stateTaxes[commands[2]] * 100);
 };
 
