[Survived] EqualityOperator
dist/src/folder_1/15_kata.js:49:13
         this.hitpoints -= damage;
     }
     hitpointBar() {
-        if (this.hitpoints === 2) {
+        if (this.hitpoints !== 2) {
             return "full";
         }
