[Survived] ArrayDeclaration
dist/src/folder_1/17_kata.js:3:28
 export const input = (commands) => {
     let totalCost = +commands[0] * +commands[1];
-    const volumeDiscount = [
-        { volume: 50000, discount: 0.15 },
-        { volume: 10000, discount: 0.10 },
-        { volume: 7000, discount: 0.07 },
-        { volume: 5000, discount: 0.05 },
-        { volume: 1000, discount: 0.03 },
-    ];
+    const volumeDiscount = [];
     volumeDiscount.some(({ volume, discount }, idx) => {
         if (totalCost >= volume) {
