[Survived] ArrayDeclaration
dist/src/folder_1/18_kata.js:3:18
 export class Zergling {
     hitpoints = 1;
-    closeUnits = [];
+    closeUnits = ["Stryker was here"];
     attack(unit) {
         if (this.closeUnits.includes(unit)) {

[Survived] BlockStatement
dist/src/folder_1/18_kata.js:5:45
     hitpoints = 1;
     closeUnits = [];
     attack(unit) {
-        if (this.closeUnits.includes(unit)) {
-            unit.hurt(1);
-        }
+        if (this.closeUnits.includes(unit)) {}
     }
     alive() {
