[Survived] ConditionalExpression
dist/src/folder_1/19_kata.js:10:16
         }
     }
     alive() {
-        return this.hitpoints > 0;
+        return false;
     }
     run(unit) {

[Survived] ConditionalExpression
dist/src/folder_1/19_kata.js:49:13
         this.hitpoints -= damage;
     }
     hitpointBar() {
-        if (this.hitpoints === 2) {
+        if (false) {
             return "full";
         }

[Survived] EqualityOperator
dist/src/folder_1/19_kata.js:64:16
         }
     }
     alive() {
-        return this.hitpoints > 0;
+        return this.hitpoints <= 0;
     }
     run(unit) {
