[Survived] BlockStatement
dist/src/folder_1/2_kata.js:11:34
         { volume: 1000, discount: 0.03 },
     ];
     volumeDiscount.some(({ volume, discount }, idx) => {
-        if (totalCost >= volume) {
-            totalCost = totalCost * (1 - discount);
-            return true;
-        }
+        if (totalCost >= volume) {}
         return false;
     });
