[Survived] BlockStatement
src/folder_1/12_kata.ts:9:31
 export class Zergling implements IUnit {
     hitpoints = 1;
     closeUnits: IUnit[] = [];
-    attack(unit: IUnit): void {
-        if (this.closeUnits.includes(unit)) {
-            unit.hurt(1);
-        }
-    }
+    attack(unit: IUnit): void {}
 
     alive(): boolean {

[Killed] ConditionalExpression
src/folder_1/12_kata.ts:10:13
     hitpoints = 1;
     closeUnits: IUnit[] = [];
     attack(unit: IUnit): void {
-        if (this.closeUnits.includes(unit)) {
+        if (true) {
             unit.hurt(1);
         }
killedBy: can do battle four the vile zerg zergling cannot hit a unit it has not run at
statusReason: expected 'not full' to equal 'full'

[Survived] BlockStatement
src/folder_1/12_kata.ts:10:45
     hitpoints = 1;
     closeUnits: IUnit[] = [];
     attack(unit: IUnit): void {
-        if (this.closeUnits.includes(unit)) {
-            unit.hurt(1);
-        }
+        if (this.closeUnits.includes(unit)) {}
     }
 

[Killed] BlockStatement
src/folder_1/12_kata.ts:15:22
         }
     }
 
-    alive(): boolean {
-        return this.hitpoints > 0;
-    }
+    alive(): boolean {}
 
     run(unit: IUnit): void {
killedBy: can do battle four the vile zerg zergling will battle the epic terran marine
statusReason: expected undefined to equal false

[Killed] ConditionalExpression
src/folder_1/12_kata.ts:16:16
     }
 
     alive(): boolean {
-        return this.hitpoints > 0;
+        return true;
     }
 
killedBy: can do battle four the vile zerg zergling will battle the epic terran marine
statusReason: expected true to equal false

[Killed] EqualityOperator
src/folder_1/12_kata.ts:16:16
     }
 
     alive(): boolean {
-        return this.hitpoints > 0;
+        return this.hitpoints <= 0;
     }
 
killedBy: can do battle four the vile zerg zergling will battle the epic terran marine
statusReason: expected true to equal false

[Survived] BlockStatement
src/folder_1/12_kata.ts:19:28
         return this.hitpoints > 0;
     }
 
-    run(unit: IUnit): void {
-        this.closeUnits.push(unit);
-    }
+    run(unit: IUnit): void {}
 
     hurt(damage: number): void {

[Killed] BlockStatement
src/folder_1/12_kata.ts:23:32
         this.closeUnits.push(unit);
     }
 
-    hurt(damage: number): void {
-        this.hitpoints -= damage;
-    }
+    hurt(damage: number): void {}
 }
 export class Marine implements IUnit {
killedBy: can do battle four the vile zerg zergling will battle the epic terran marine
statusReason: expected true to equal false

[Killed] AssignmentOperator
src/folder_1/12_kata.ts:24:9
     }
 
     hurt(damage: number): void {
-        this.hitpoints -= damage;
+        this.hitpoints += damage;
     }
 }
killedBy: can do battle four the vile zerg zergling will battle the epic terran marine
statusReason: expected true to equal false

[NoCoverage] BlockStatement
src/folder_1/12_kata.ts:29:31
 }
 export class Marine implements IUnit {
     hitpoints = 2;
-    attack(unit: IUnit): void {
-        this.shoot(unit);
-    }
+    attack(unit: IUnit): void {}
 
     alive(): boolean {

[Killed] BlockStatement
src/folder_1/12_kata.ts:33:22
         this.shoot(unit);
     }
 
-    alive(): boolean {
-        return true;
-    }
+    alive(): boolean {}
 
     shoot(unit: IUnit): void {
killedBy: can do battle four the vile zerg zergling will battle the epic terran marine
statusReason: expected undefined to equal true

[Killed] BooleanLiteral
src/folder_1/12_kata.ts:34:16
     }
 
     alive(): boolean {
-        return true;
+        return false;
     }
 
killedBy: can do battle four the vile zerg zergling will battle the epic terran marine
statusReason: expected false to equal true

[Killed] BlockStatement
src/folder_1/12_kata.ts:37:30
         return true;
     }
 
-    shoot(unit: IUnit): void {
-        unit.hurt(1);
-    }
+    shoot(unit: IUnit): void {}
     hurt(damage: number): void {
         this.hitpoints -= damage;
killedBy: can do battle four the vile zerg zergling will battle the epic terran marine
statusReason: expected true to equal false

[Survived] BlockStatement
src/folder_1/12_kata.ts:40:32
     shoot(unit: IUnit): void {
         unit.hurt(1);
     }
-    hurt(damage: number): void {
-        this.hitpoints -= damage;
-    }
+    hurt(damage: number): void {}
 }
 export class Zealot implements IUnit {

[NoCoverage] BlockStatement
src/folder_1/12_kata.ts:46:31
 }
 export class Zealot implements IUnit {
     hitpoints = 2;
-    attack(unit: IUnit): void {
-        this.claw(unit);
-    }
+    attack(unit: IUnit): void {}
 
     alive(): boolean {

[Survived] BlockStatement
src/folder_1/12_kata.ts:54:29
         return true;
     }
 
-    claw(unit: IUnit): void {
-        unit.hurt(2);
-    }
+    claw(unit: IUnit): void {}
 
     hurt(damage: number): void {

[Killed] BlockStatement
src/folder_1/12_kata.ts:62:27
         this.hitpoints -= damage;
     }
 
-    hitpointBar(): string {
-        if (this.hitpoints === 2) {
-            return "full";
-        }
-        return "not full";
-    }
+    hitpointBar(): string {}
 }
killedBy: can do battle four the vile zerg zergling cannot hit a unit it has not run at
statusReason: expected undefined to equal 'full'

[Killed] ConditionalExpression
src/folder_1/12_kata.ts:63:13
     }
 
     hitpointBar(): string {
-        if (this.hitpoints === 2) {
+        if (false) {
             return "full";
         }
killedBy: can do battle four the vile zerg zergling cannot hit a unit it has not run at
statusReason: expected 'not full' to equal 'full'

[Killed] EqualityOperator
src/folder_1/12_kata.ts:63:13
     }
 
     hitpointBar(): string {
-        if (this.hitpoints === 2) {
+        if (this.hitpoints !== 2) {
             return "full";
         }
killedBy: can do battle four the vile zerg zergling cannot hit a unit it has not run at
statusReason: expected 'not full' to equal 'full'

[Killed] StringLiteral
src/folder_1/12_kata.ts:64:20
 
     hitpointBar(): string {
         if (this.hitpoints === 2) {
-            return "full";
+            return "";
         }
         return "not full";
killedBy: can do battle four the vile zerg zergling cannot hit a unit it has not run at
statusReason: expected '' to equal 'full'
