[Survived] ArrayDeclaration
src/folder_1/15_kata.ts:8:27
 }
 export class Zergling implements IUnit {
     hitpoints = 1;
-    closeUnits: IUnit[] = [];
+    closeUnits: IUnit[] = ["Stryker was here"];
     attack(unit: IUnit): void {
         if (this.closeUnits.includes(unit)) {

[Survived] ConditionalExpression
src/folder_1/15_kata.ts:10:13
     hitpoints = 1;
     closeUnits: IUnit[] = [];
     attack(unit: IUnit): void {
-        if (this.closeUnits.includes(unit)) {
+        if (false) {
             unit.hurt(1);
         }

[Killed] BlockStatement
src/folder_1/15_kata.ts:63:35
     }
 
     hitpointBar(): string {
-        if (this.hitpoints === 2) {
-            return "full";
-        }
+        if (this.hitpoints === 2) {}
         return "not full";
     }
killedBy: can do battle five the vile zerg zergling cannot hit a unit it has not run at
statusReason: expected 'not full' to equal 'full'
