[Killed] BlockStatement
src/folder_1/10_kata.ts:1:40
-export function* helloWorldGenerator() {
-    yield 'Hello';
-    yield 'World';
-}
+export function* helloWorldGenerator() {}
 
 export default function HelloWorld() {
killedBy: hello world kata four should return hello world
statusReason: '' == 'Hello World'

[Killed] BlockStatement
src/folder_1/10_kata.ts:6:38
     yield 'World';
 }
 
-export default function HelloWorld() {
-    return Array.from(helloWorldGenerator()).join(' ');
-}
+export default function HelloWorld() {}
 
killedBy: hello world kata four should return hello world
statusReason: undefined == 'Hello World'
