[Killed] BlockStatement
src/folder_1/11_kata.ts:3:36
 ﻿
 
-export const input = (commands) => {
-    let totalCost = +commands[0] * +commands[1];
-    const volumeDiscount = [
-        { volume: 50000, discount: 0.15 },
-        { volume: 10000, discount: 0.10 },
-        { volume: 7000, discount: 0.07 },
-        { volume: 5000, discount: 0.05 },
-        { volume: 1000, discount: 0.03 },
-    ]
-    volumeDiscount.some(({volume, discount}, idx) => {
-        if (totalCost >= volume) {
-            totalCost = totalCost * (1 - discount)
-            return true;
-        }
-        return false;
-    })
-    const stateTaxes = {
-        UT: 6.85,
-        NV: 8.00,
-        TX: 6.25,
-        AL: 4.00,
-        CA: 8.25,
-    }
-    return totalCost * (1 + stateTaxes[commands[2]] / 100);
-}
+export const input = (commands) => {}
killedBy: kata two four given 0 items can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected undefined to equal +0

[Killed] ArithmeticOperator
src/folder_1/11_kata.ts:4:21
 ﻿
 
 export const input = (commands) => {
-    let totalCost = +commands[0] * +commands[1];
+    let totalCost = +commands[0] / +commands[1];
     const volumeDiscount = [
         { volume: 50000, discount: 0.15 },
killedBy: kata two four given 1 item and a NV state code can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected 0.21600000000000003 to equal 5.4

[Killed] UnaryOperator
src/folder_1/11_kata.ts:4:36
 ﻿
 
 export const input = (commands) => {
-    let totalCost = +commands[0] * +commands[1];
+    let totalCost = +commands[0] * -commands[1];
     const volumeDiscount = [
         { volume: 50000, discount: 0.15 },
killedBy: kata two four given 1 item and a NV state code can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected -5.4 to equal 5.4

[Killed] ObjectLiteral
src/folder_1/11_kata.ts:7:9
     let totalCost = +commands[0] * +commands[1];
     const volumeDiscount = [
         { volume: 50000, discount: 0.15 },
-        { volume: 10000, discount: 0.10 },
+        {},
         { volume: 7000, discount: 0.07 },
         { volume: 5000, discount: 0.05 },
killedBy: kata two four given 10000 of items can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected 10044 to equal 9720

[Killed] ObjectLiteral
src/folder_1/11_kata.ts:9:9
         { volume: 50000, discount: 0.15 },
         { volume: 10000, discount: 0.10 },
         { volume: 7000, discount: 0.07 },
-        { volume: 5000, discount: 0.05 },
+        {},
         { volume: 1000, discount: 0.03 },
     ]
killedBy: kata two four given 5000 of items can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected 5238 to equal 5130

[Killed] ObjectLiteral
src/folder_1/11_kata.ts:10:9
         { volume: 10000, discount: 0.10 },
         { volume: 7000, discount: 0.07 },
         { volume: 5000, discount: 0.05 },
-        { volume: 1000, discount: 0.03 },
+        {},
     ]
     volumeDiscount.some(({volume, discount}, idx) => {
killedBy: kata two four given 1000 of items can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected 1080 to equal 1047.6000000000001

[Killed] BlockStatement
src/folder_1/11_kata.ts:12:54
         { volume: 5000, discount: 0.05 },
         { volume: 1000, discount: 0.03 },
     ]
-    volumeDiscount.some(({volume, discount}, idx) => {
-        if (totalCost >= volume) {
-            totalCost = totalCost * (1 - discount)
-            return true;
-        }
-        return false;
-    })
+    volumeDiscount.some(({volume, discount}, idx) => {})
     const stateTaxes = {
         UT: 6.85,
killedBy: kata two four given 1000 of items can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected 1080 to equal 1047.6000000000001

[Killed] MethodExpression
src/folder_1/11_kata.ts:12:5
         { volume: 5000, discount: 0.05 },
         { volume: 1000, discount: 0.03 },
     ]
-    volumeDiscount.some(({volume, discount}, idx) => {
-        if (totalCost >= volume) {
-            totalCost = totalCost * (1 - discount)
-            return true;
-        }
-        return false;
-    })
+    volumeDiscount.every(({
+  volume,
+  discount
+}, idx) => {
+  if (totalCost >= volume) {
+    totalCost = totalCost * (1 - discount);
+    return true;
+  }
+  return false;
+})
     const stateTaxes = {
         UT: 6.85,
killedBy: kata two four given 1000 of items can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected 1080 to equal 1047.6000000000001

[Killed] EqualityOperator
src/folder_1/11_kata.ts:13:13
         { volume: 1000, discount: 0.03 },
     ]
     volumeDiscount.some(({volume, discount}, idx) => {
-        if (totalCost >= volume) {
+        if (totalCost < volume) {
             totalCost = totalCost * (1 - discount)
             return true;
killedBy: kata two four given 1 item and a NV state code can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected 4.59 to equal 5.4

[Killed] EqualityOperator
src/folder_1/11_kata.ts:13:13
         { volume: 1000, discount: 0.03 },
     ]
     volumeDiscount.some(({volume, discount}, idx) => {
-        if (totalCost >= volume) {
+        if (totalCost > volume) {
             totalCost = totalCost * (1 - discount)
             return true;
killedBy: kata two four given 1000 of items can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected 1080 to equal 1047.6000000000001

[Killed] ArithmeticOperator
src/folder_1/11_kata.ts:14:38
     ]
     volumeDiscount.some(({volume, discount}, idx) => {
         if (totalCost >= volume) {
-            totalCost = totalCost * (1 - discount)
+            totalCost = totalCost * (1 + discount)
             return true;
         }
killedBy: kata two four given 1000 of items can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected 1112.4 to equal 1047.6000000000001

[Killed] ArithmeticOperator
src/folder_1/11_kata.ts:14:25
     ]
     volumeDiscount.some(({volume, discount}, idx) => {
         if (totalCost >= volume) {
-            totalCost = totalCost * (1 - discount)
+            totalCost = totalCost / (1 - discount)
             return true;
         }
killedBy: kata two four given 1000 of items can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected 1113.4020618556704 to equal 1047.6000000000001

[Killed] BooleanLiteral
src/folder_1/11_kata.ts:15:20
     volumeDiscount.some(({volume, discount}, idx) => {
         if (totalCost >= volume) {
             totalCost = totalCost * (1 - discount)
-            return true;
+            return false;
         }
         return false;
killedBy: kata two four given 5000 of items can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected 4976.1 to equal 5130

[Killed] ObjectLiteral
src/folder_1/11_kata.ts:19:24
         }
         return false;
     })
-    const stateTaxes = {
-        UT: 6.85,
-        NV: 8.00,
-        TX: 6.25,
-        AL: 4.00,
-        CA: 8.25,
-    }
+    const stateTaxes = {}
     return totalCost * (1 + stateTaxes[commands[2]] / 100);
 }
killedBy: kata two four given 0 items can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected NaN to equal +0

[Killed] ArithmeticOperator
src/folder_1/11_kata.ts:26:25
         AL: 4.00,
         CA: 8.25,
     }
-    return totalCost * (1 + stateTaxes[commands[2]] / 100);
+    return totalCost * (1 - stateTaxes[commands[2]] / 100);
 }
killedBy: kata two four given 1 item and a NV state code can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected 4.6000000000000005 to equal 5.4

[Killed] ArithmeticOperator
src/folder_1/11_kata.ts:26:29
         AL: 4.00,
         CA: 8.25,
     }
-    return totalCost * (1 + stateTaxes[commands[2]] / 100);
+    return totalCost * (1 + stateTaxes[commands[2]] * 100);
 }
killedBy: kata two four given 1 item and a NV state code can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected 4005 to equal 5.4
