[Killed] ArrayDeclaration
src/folder_1/14_kata.ts:5:28
 
 export const input = (commands) => {
     let totalCost = +commands[0] * +commands[1];
-    const volumeDiscount = [
-        { volume: 50000, discount: 0.15 },
-        { volume: 10000, discount: 0.10 },
-        { volume: 7000, discount: 0.07 },
-        { volume: 5000, discount: 0.05 },
-        { volume: 1000, discount: 0.03 },
-    ]
+    const volumeDiscount = []
     volumeDiscount.some(({volume, discount}, idx) => {
         if (totalCost >= volume) {
killedBy: kata two five given 1000 of items can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected 1080 to equal 1047.6000000000001

[Killed] ObjectLiteral
src/folder_1/14_kata.ts:8:9
     const volumeDiscount = [
         { volume: 50000, discount: 0.15 },
         { volume: 10000, discount: 0.10 },
-        { volume: 7000, discount: 0.07 },
+        {},
         { volume: 5000, discount: 0.05 },
         { volume: 1000, discount: 0.03 },
killedBy: kata two five given 7000 of items can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected 7182.000000000001 to equal 7030.8

[Killed] ConditionalExpression
src/folder_1/14_kata.ts:13:13
         { volume: 1000, discount: 0.03 },
     ]
     volumeDiscount.some(({volume, discount}, idx) => {
-        if (totalCost >= volume) {
+        if (true) {
             totalCost = totalCost * (1 - discount)
             return true;
killedBy: kata two five given 1 item and a NV state code can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected 4.59 to equal 5.4
