[Killed] UnaryOperator
src/folder_1/17_kata.ts:4:21
 ﻿
 
 export const input = (commands) => {
-    let totalCost = +commands[0] * +commands[1];
+    let totalCost = -commands[0] * +commands[1];
     const volumeDiscount = [
         { volume: 50000, discount: 0.15 },
killedBy: kata two six given 1 item and a NV state code can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected -5.4 to equal 5.4

[Killed] ConditionalExpression
src/folder_1/17_kata.ts:13:13
         { volume: 1000, discount: 0.03 },
     ]
     volumeDiscount.some(({volume, discount}, idx) => {
-        if (totalCost >= volume) {
+        if (false) {
             totalCost = totalCost * (1 - discount)
             return true;
killedBy: kata two six given 1000 of items can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected 1080 to equal 1047.6000000000001

[Killed] ArithmeticOperator
src/folder_1/17_kata.ts:26:12
         AL: 4.00,
         CA: 8.25,
     }
-    return totalCost * (1 + stateTaxes[commands[2]] / 100);
+    return totalCost / (1 + stateTaxes[commands[2]] / 100);
 }
killedBy: kata two six given 1 item and a NV state code can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected 4.62962962962963 to equal 5.4
