[Killed] StringLiteral
src/folder_1/1_kata.ts:2:11
 export function* helloWorldGenerator() {
-    yield 'Hello';
+    yield "";
     yield 'World';
 }
killedBy: hello world kata should return hello world
statusReason: ' World' == 'Hello World'
