[Killed] BlockStatement
src/folder_1/2_kata.ts:13:34
         { volume: 1000, discount: 0.03 },
     ]
     volumeDiscount.some(({volume, discount}, idx) => {
-        if (totalCost >= volume) {
-            totalCost = totalCost * (1 - discount)
-            return true;
-        }
+        if (totalCost >= volume) {}
         return false;
     })
killedBy: kata two given 1000 of items can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected 1080 to equal 1047.6000000000001
