[Killed] ObjectLiteral
src/folder_1/5_kata.ts:6:9
 export const input = (commands) => {
     let totalCost = +commands[0] * +commands[1];
     const volumeDiscount = [
-        { volume: 50000, discount: 0.15 },
+        {},
         { volume: 10000, discount: 0.10 },
         { volume: 7000, discount: 0.07 },
killedBy: kata two two given 50000 of items can accept an input of how many items, cost per item, state code, and calculate total value
statusReason: expected 48600 to equal 45900
