[Killed] StringLiteral
src/folder_1/7_kata.ts:3:11
 export function* helloWorldGenerator() {
     yield 'Hello';
-    yield 'World';
+    yield "";
 }
 
killedBy: hello world kata three should return hello world
statusReason: 'Hello ' == 'Hello World'

[Killed] StringLiteral
src/folder_1/7_kata.ts:7:51
 }
 
 export default function HelloWorld() {
-    return Array.from(helloWorldGenerator()).join(' ');
+    return Array.from(helloWorldGenerator()).join("");
 }
 
killedBy: hello world kata three should return hello world
statusReason: 'HelloWorld' == 'Hello World'
